'''3. Сформувати функцію для обчислення індексу максимального елемента масиву
n*n, де 1<=n<=5.
Виконав: Лещенко В. О.

В даному випадку більш доцільніше використовувати ітерарацію.
Час розробки для методу ітерації був меншим, затрачений час на виконання також менший.
Читабельність з використанням ітерції більш зрозуміла.'''

import random
import timeit
import numpy as np

def max_index_iter(A): # знаходимо індекс максимального елемента за допомогою ітерацїі
    max = 0
    for i in range(n):
        for j in range(n): # за допомогою двох циклів проходимо двохвимірний масив і привласнюємо нове максимальне значенням, якщо воно більше за попереднє
            if (A[i][j] > max):
                max = A[i][j]
                i_max = i # запам'ятовуємо рядок максимального індекса
                j_max = j # та стовпчик
    return i_max, j_max # виводимо їх

def max_index_rec(A, count=0, temp=0, i=0, j=0): # знаходимо індекс максимального елемента за допомогою рекурсії
    if temp == len(A[count]):
        count += 1 # якщо індекс елемента по стовпчику співвпадає із довжиною рядка, переходимо на наступний рядок
        temp = 0
    if count == len(A):
        return i, j
    if A[count][temp] > A[i][j]: # проходимо по двохвимірному масиві і перевіряємо
        i = count
        j = temp
    temp += 1 # проходимо кожний наступний елемент у масиві
    return max_index_rec(A, count, temp, i, j) # шукаємо далі


while True:
    n = int(input('Введіть розмірність масиву від 1 до 5: '))
    if n < 1 or n > 5: # перевіряємо чи задовільняють введенні дані умові задачі
        print('Розмірність має бути від 1 до 5!\n')
        continue
    else:
        A = np.zeros((n, n), dtype=int) # якщо так - створюємо двохвимірний масив

    for i in range(len(A)):
        for j in range(len(A)):
            A[i, j] = random.randint(1, 20) # рандомно заповнюємо його числами від 1 до 20
    print(A) # друкуємо масив
    break

question = int(input('Який спосіб використовувати: рекурсія (1) чи ітерація (2): '))
if question == 1:
    print(f'Індекс максимального елемента дорівнює {max_index_rec(A)}.')
elif question == 2:
    print(f'Індекс максимального елемента дорівнює {max_index_iter(A)}.')
print('Затрачений час: ', timeit.timeit('"-".join(str(n) for n in range(100))', number=10000))