'''1. Сформувати функцію для введення з клавіатури послідовності чисел і виведення
її на екран у зворотному порядку (завершаючий символ послідовності – крапка).
Виконав: Лещенко В. О.

В даному випадку більш доцільніше використовувати ітерарацію.
Час розробки однаковий, затрачений час на виконання трішки менший у випадку з ітерацією.
Читабельність з використанням ітерції більш зрозуміла, хоча і рекурсія досить проста.'''

import timeit

def func_rec(A): # рекурсія
    print(A[-1], end = '') # друкуємо останній елемент, при цьому не переносимо курсор на новий рядок
    if len(A) > 1: # поки довжина більше одиниці
        func_rec(A[:-1]) # застосовуємо функцію без останнього елемента

def func_iter(A): # ітерація
    for i in range(-1, -len(A) - 1, -1): # проходимо всі елементи з останнього до першого
        print(A[i], end = '') # і друкуємо, не переносячи рядок

while True:
    A = input('Введіть послідовність: ')
    if A[-1] == '.': # перевіряємо чи стоїть в кінці послідовності крапка
        break
    else:
        print('В кінці послідовності має бути крапка.\n')

question = int(input('Який спосіб використовувати: рекурсія (1) чи ітерація (2): '))
if question == 1:
    func_rec(A)
    print()
elif question == 2:
    func_iter(A)
    print()
print('Затрачений час: ', timeit.timeit('"-".join(str(n) for n in range(100))', number=10000))